#!/usr/bin/env python
# coding: utf-8

# In[68]:


import pandas as pd
import numpy as np
from scipy.stats import *
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity="all"


# In[69]:


sales = pd.read_csv('seoul_sales_sanggwon2018.csv',encoding='CP949')


# In[71]:


sales


# ### 구분
# * 성별
# * 연령
# * 시간대
# 

# In[79]:


# base = sales[['기준_년_코드','상권_구분_코드_명','서비스_업종_코드_명','점포수']]  
sales = sales[['기준_년_코드','상권_구분_코드_명','서비스_업종_코드_명','점포수','남성_매출_비율', '여성_매출_비율','연령대_10_매출_비율','연령대_20_매출_비율','연령대_30_매출_비율','연령대_40_매출_비율','연령대_50_매출_비율','연령대_60_이상_매출_비율','남성_매출_금액','여성_매출_금액','연령대_10_매출_금액','연령대_20_매출_금액','연령대_30_매출_금액','연령대_40_매출_금액','연령대_50_매출_금액','연령대_60_이상_매출_금액','시간대_00~06_매출_비율','시간대_06~11_매출_비율','시간대_11~14_매출_비율','시간대_14~17_매출_비율','시간대_17~21_매출_비율','시간대_21~24_매출_비율','남성_매출_건수','여성_매출_건수','연령대_10_매출_건수','연령대_20_매출_건수','연령대_30_매출_건수','연령대_40_매출_건수','연령대_50_매출_건수','연령대_60_이상_매출_건수']]


# In[75]:


sales.describe()


# In[80]:


sales.columns = ['기준년코드','상권구분코드명','서비스업종코드명','점포수','남성매출비율','여성매출비율','10대매출비율','20대매출비율','30대매출_비율','40대매출비율','50대매출비율','60대이상매출비율','남성매출금액','여성매출금액','10대매출금액','20대매출금액','30대매출금액','40대매출금액','50대매출금액','60대이상매출금액','0006매출비율','0611매출비율','1114매출비율','1417매출비율','1721매출비율','2124매출비율','남성매출건수','여성매출건수','10대매출건수','20대매출건수','30대매출건수','40대매출건수','50대매출건수','60대이상매출건수']


# In[81]:


sales


# In[30]:


kind = []


# In[31]:


for i in base['서비스업종코드명'] :
    if i == '커피-음료' :
        i = '카페'
    elif i == '분식전문점' :
        i = '분식'
    elif i == '중식음식점' :
        i = '중식'
    elif i == '호프-간이주점':
        i = '주점'
    elif i == '한식음식점' :
        i = '한식'
    elif i == '양식음식점' :
        i = '양식'
    elif i == '일식음식점' :
        i = '일식'
    elif i == '치킨전문점' :
        i = '치킨'
    elif i == '패스트푸드점' :
        i = '패스트푸드'
    else :
        i = '없음'
    kind.append(i)


# In[82]:


sales["서비스업종코드명2"] = kind


# In[83]:


sales


# In[84]:


sales = sales[sales.서비스업종코드명2 != '없음']


# In[86]:


sales.reset_index(inplace=True)


# In[88]:


del sales['index']


# In[90]:


del sales['서비스업종코드명']


# In[92]:


sales.columns


# In[93]:


sales = sales[['기준년코드', '상권구분코드명','서비스업종코드명2', '점포수', '남성매출비율', '여성매출비율', '10대매출비율', '20대매출비율',
       '30대매출_비율', '40대매출비율', '50대매출비율', '60대이상매출비율', '남성매출금액', '여성매출금액',
       '10대매출금액', '20대매출금액', '30대매출금액', '40대매출금액', '50대매출금액', '60대이상매출금액',
       '0006매출비율', '0611매출비율', '1114매출비율', '1417매출비율', '1721매출비율', '2124매출비율',
       '남성매출건수', '여성매출건수', '10대매출건수', '20대매출건수', '30대매출건수', '40대매출건수',
       '50대매출건수', '60대이상매출건수']]


# In[99]:


sales.rename(columns={'서비스업종코드명2':'업태구분명'}, inplace=True)


# In[100]:


sales


# In[101]:


sales.to_csv('./서울시상권추정매출2018.csv')


# In[102]:


sales.columns

